Ran Plan for 2 projects:

1. project: `diplom-stage` dir: `infrastructure` workspace: `stage`
1. project: `diplom-prod` dir: `infrastructure` workspace: `prod`

### 1. project: `diplom-stage` dir: `infrastructure` workspace: `stage`
<details><summary>Show Output</summary>

```diff

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of yandex-cloud/yandex...
- Installing yandex-cloud/yandex v0.77.0...
- Installed yandex-cloud/yandex v0.77.0 (unauthenticated)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "stage".


No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p diplom-stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=anguisa%252Fdevops-diplom-terraform%252Finfrastructure%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p diplom-stage`
</details>
No changes. Your infrastructure matches the configuration.

---
### 2. project: `diplom-prod` dir: `infrastructure` workspace: `prod`
<details><summary>Show Output</summary>

```diff

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of yandex-cloud/yandex...
- Installing yandex-cloud/yandex v0.77.0...
- Installed yandex-cloud/yandex v0.77.0 (unauthenticated)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "prod".


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.bastion-vm will be created
+ resource "yandex_compute_instance" "bastion-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "bastion"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89ovh4ticpo40dkbvd"
              + name        = (known after apply)
              + size        = 100
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.master-vm["cp1"] will be created
+ resource "yandex_compute_instance" "master-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "cp1"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89ovh4ticpo40dkbvd"
              + name        = (known after apply)
              + size        = 100
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = false
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.master-vm["cp2"] will be created
+ resource "yandex_compute_instance" "master-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "cp2"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89ovh4ticpo40dkbvd"
              + name        = (known after apply)
              + size        = 100
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = false
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.master-vm["cp3"] will be created
+ resource "yandex_compute_instance" "master-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "cp3"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-c"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89ovh4ticpo40dkbvd"
              + name        = (known after apply)
              + size        = 100
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = false
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.nat-vm will be created
+ resource "yandex_compute_instance" "nat-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "nat-vm-instance"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = (known after apply)

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80mrhj8fl2oe87o4e1"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.worker-vm["node1"] will be created
+ resource "yandex_compute_instance" "worker-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "node1"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89ovh4ticpo40dkbvd"
              + name        = (known after apply)
              + size        = 200
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = false
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.worker-vm["node2"] will be created
+ resource "yandex_compute_instance" "worker-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "node2"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89ovh4ticpo40dkbvd"
              + name        = (known after apply)
              + size        = 200
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = false
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_compute_instance.worker-vm["node3"] will be created
+ resource "yandex_compute_instance" "worker-vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                my_key:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh4hMurT3XcuZVO6Iral4CLw+umMuJERR+qCm02leHCcoOczgxYn4TRkbNmqE2fMKxvzdv0223CD706rhZ1jLaTtPln4mx7NkFGQ9kY7gSL9rETTwJDd9mIU0gC60HQyvL6TzYuk5bHQauJO5zx7uab8Nwy2uSByQDHtt81cd6RQC9JHl7pKmgsLaGOiIGx19iphYBm4YiKT42u8ZGbEDJvoQaZ17PMLFQLrx0gvwo0J50fJyVxy+aV4ORp6JnskXvjpw45eMXb0MGJzxZAyjsJgmZJ+rLbeO3lh3WpbyH/e/Mh5gaTcnAAXOTDne2SAkBlQ1gIw7h/Wm9am8m+gMiKdwZqIutX7zTsEc0uP1hl+zhBik/6EMgyZte9qWMOCvrwa8kFSfM7hzRstwXwhWtgq0lCabe/DAk1D2+1lcNmt73SHBL+L3mt5F/XaQCTE4zTG3v2fz74gZu3NTwA7Xqn72wSaJ7OxeTYDUPF8OULY6Ll0b5cdWydbkHvPqrKgc= olga@fedora
            EOT
        }
      + name                      = "node3"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-c"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89ovh4ticpo40dkbvd"
              + name        = (known after apply)
              + size        = 200
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = false
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = (known after apply)
        }
    }

  # yandex_lb_network_load_balancer.network-lb will be created
+ resource "yandex_lb_network_load_balancer" "network-lb" {
      + created_at = (known after apply)
      + folder_id  = "b1gcefcbnh0ok32bkvif1"
      + id         = (known after apply)
      + name       = "network-lb1"
      + region_id  = "ru-central1"
      + type       = "external"

      + attached_target_group {
          + target_group_id = (known after apply)

          + healthcheck {
              + healthy_threshold   = 2
              + interval            = 2
              + name                = "http"
              + timeout             = 1
              + unhealthy_threshold = 2

              + http_options {
                  + path = "/healthz"
                  + port = 10254
                }
            }
        }

      + listener {
          + name        = "listener1"
          + port        = 8000
          + protocol    = "tcp"
          + target_port = 80
        }
      + listener {
          + name        = "listener2"
          + port        = 443
          + protocol    = "tcp"
          + target_port = 443
        }
    }

  # yandex_lb_target_group.tg-lb will be created
+ resource "yandex_lb_target_group" "tg-lb" {
      + created_at = (known after apply)
      + folder_id  = "b1gcefcbnh0ok32bkvif1"
      + id         = (known after apply)
      + name       = "tg-lb1"
      + region_id  = "ru-central1"

      + target {
          + address   = (known after apply)
          + subnet_id = (known after apply)
        }
      + target {
          + address   = (known after apply)
          + subnet_id = (known after apply)
        }
      + target {
          + address   = (known after apply)
          + subnet_id = (known after apply)
        }
    }

  # yandex_vpc_network.vpc will be created
+ resource "yandex_vpc_network" "vpc" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "vpc-network"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_route_table.route-table-nat will be created
+ resource "yandex_vpc_route_table" "route-table-nat" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + next_hop_address   = (known after apply)
        }
    }

  # yandex_vpc_subnet.private-subnet["cp1"] will be created
+ resource "yandex_vpc_subnet" "private-subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet1"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.private-subnet["cp2"] will be created
+ resource "yandex_vpc_subnet" "private-subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet2"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.private-subnet["cp3"] will be created
+ resource "yandex_vpc_subnet" "private-subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet3"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.30.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-c"
    }

  # yandex_vpc_subnet.private-subnet["node1"] will be created
+ resource "yandex_vpc_subnet" "private-subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet4"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.40.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.private-subnet["node2"] will be created
+ resource "yandex_vpc_subnet" "private-subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet5"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.50.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.private-subnet["node3"] will be created
+ resource "yandex_vpc_subnet" "private-subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet6"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.60.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-c"
    }

  # yandex_vpc_subnet.public-subnet will be created
+ resource "yandex_vpc_subnet" "public-subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "subnet0"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.5.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 19 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p diplom-prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=anguisa%252Fdevops-diplom-terraform%252Finfrastructure%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p diplom-prod`
</details>
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
